#ifndef _STRUCT_H
#define _STRUCT_H

/***********************************************************************************
 * Если ping_pong_flag == 0 - собираем пинг, отправляем на карту понг
 * Если ping_pong_flag == 1 - собираем пoнг, отправляем на карту пинг
 * Подсчитаем, какой объем буфера должен быть для каждой частоты
 * Размер кучи щас выбран как 32768 байт. В ней дожны помещаться:
 * 2 буфера одинакового размера + должно  быть еще минимум ~10-20 кБайт на все остальное
 * Размер буфера PING или PONG должен быть кратен 4!
 * число записей в минуту д.б. таким, чтобы 60 делилось на него без остатка
 * Сейчас размер PING или PONG - выбран MAX 12000 байт, 
 * Размер буфера PING или PONG - описан здесь:
 ***********************************************************************************/
static const ADS131_WORK_STRUCT adc_work_struct[] = {
//freq, decim,  bytes in pack, sec, num_in_pack, pack_size, period_us, sig in min, sig in hour
/**************************************************************************************************
 * 125 Гц - делим 1000 на 8
 * 125 Гц, дец=8,  3 байт/пак, 30 сек  3750 отсч. и 11250 байт в пинге, 8000 мкс, 2 зап/мин,  120/час 
 * 125 Гц, дец=8,  6 байт/пак, 10 сек  1250 отсч. и 7500 байт в пинге, 8000 мкс, 6 зап/мин, 360/час 
 * 125 Гц, дец=8,  9 байт/пак, 10 сек  1250 отсч. и 11250 байт в пинге, 8000 мкс, 3 зап/мин, 180/час 
 * 125 Гц, дец=8, 12 байт/пак, 6 сек  750 отсч. и 9000 байт в пинге, 8000 мкс, 10 зап/мин, 600/час
 **************************************************************************************************/
	{ SPS125, 8,  3, 30,  3750, 11250, 8000, 2,  120},//
	{ SPS125, 8,  6, 10,  1250, 7500, 8000, 6, 360},//	
	{ SPS125, 8,  9, 10,  1250, 11250, 8000, 6, 360},
	{ SPS125, 8, 12, 6,  750, 9000, 8000, 10, 600},

/**************************************************************************************************
 * 250 Гц - делим 2000 на 8
 * 250 Гц, дец=4,  3 байт/пак, 15 сек 3750 отсч. и 11250 байт в пинге, 4000 мкс,  4 зап/мин, 240/час 
 * 250 Гц, дец=4,  6 байт/пак, 6 сек 1500 отсч. и 9000 байт в пинге, 4000 мкс,  10 зап/мин, 600/час 
 * 250 Гц, дец=4,  9 байт/пак, 5 сек 1250 отсч. и 11250 байт в пинге, 4000 мкс,  12 зап/мин, 720/час 
 * 250 Гц, дец=4, 12 байт/пак, 3 сек 750 отсч. и 9000 байт в пинге, 4000 мкс, 20 зап/мин, 1200/час
 **************************************************************************************************/
	{ SPS250, 8,  3, 15, 3750, 11250, 4000,  3, 240}, // 
	{ SPS250, 8,  6,  6, 1500,  9000, 4000, 10, 600}, // 
	{ SPS250, 8,  9,  5, 1250, 11250, 4000, 12, 720}, // ok
	{ SPS250, 8, 12,  3,  750,  9000, 4000, 20, 1200}, // ok

/******************************************************************************************************
 * 500 Гц - делим 4000 на 8
 * 500 Гц, дец=2,  3 байт/пак,  6 сек 3000 отсч. и  9000 байт в пинге, 2000 мкс, 10 зап/мин,  600/час
 * 500 Гц, дец=2,  6 байт/пак,  3 сек 1500 отсч. и  9000 байт в пинге, 2000 мкс, 20 зап/мин, 1800/час
 * 500 Гц, дец=2,  9 байт/пак,  2 сек 1000 отсч. и  9000 байт в пинге, 2000 мкс, 30 зап/мин, 1800/час 
 * 500 Гц, дец=2, 12 байт/пак,  2 сек 1000 отсч. и 12000 байт в пинге, 2000 мкс, 30 зап/мин, 1800/час 
 *****************************************************************************************************/
	{ SPS500, 8,  3,  6, 3000,  9000, 2000,  10, 600}, // 
	{ SPS500, 8,  6,  3, 1500,  9000, 2000, 20, 1800}, // 	
	{ SPS500, 8,  9,  2, 1000,  9000, 2000, 30, 1800}, // ok                        
	{ SPS500, 8, 12,  2, 1000, 12000, 2000, 30, 1800}, // ok

/*********************************************************************************************************
 * 1000 Гц  
 * 1кГц дец=0,  3 байт/пак, раз в 3 сек, 3000 отсч. и  9000 байт в пинге, 1000 мкс, 20 зап/мин,  1200/час 
 * 1кГц дец=0,  6 байт/пак, раз в 2 сек, 2000 отсч. и 12000 байт в пинге, 1000 мкс, 30 зап/мин, 1800/час 
 * 1кГц дец=0,  9 байт/пак, раз в 1 сек, 1000 отсч. и  9000 байт в пинге, 1000 мкс, 60 зап/мин, 3600/час 
 * 1кГц дец=0, 12 байт/пак, раз в 1 сек, 1000 отсч. и 12000 байт в пинге, 1000 мкс, 60 зап/мин, 3600/час 
 *********************************************************************************************************/
	{ SPS1K, 1,  3,  3,  3000,  9000, 1000, 20,  1200},
	{ SPS1K, 1,  6,  2,  2000, 12000, 1000, 30,  1800},
	{ SPS1K, 1,  9,  1,  1000,  9000, 1000, 60, 3600}, 
	{ SPS1K, 1, 12,  1,  1000, 12000, 1000, 60, 3600}, 

/************************************************************************************************** 
 * 2000 Гц - пишет каждую секунду
 * 2кГц, дец=0,  3 байт/пак,   2 сек  4000 отсч,  12000 байт в пинге, 500 мкс,  30 зап/мин, 1800/час
 * 2кГц, дец=0,  6 байт/пак,   1 сек  2000 отcч,  12000 байт в пинге, 500 мкс,  60 зап/мин, 3600/час 
 * 2кГц, дец=0,  9 байт/пак,  1/2 сек 1000 отсч,  9000 байт в пинге, 500 мкс,  120 зап/мин, 7200/час
 * 2кГц, дец=0, 12 байт/пак,  1/2 сек 1000 отсч, 12000 байт в пинге, 500 мкс,  120 зап/мин, 7200/час
***************************************************************************************************/
	{ SPS2K, 1,  3,  2,  4000, 12000,  500,   30, 1800},
	{ SPS2K, 1,  6,  1,  2000, 12000,  500,   60, 3600},
	{ SPS2K, 1,  9,  0,  1000,  9000,  500,  120, 7200},
	{ SPS2K, 1, 12,  0,  1000, 12000,  500,  120, 7200},

/**************************************************************************************************
 * 4000 Гц - не стоит поддерживать в рабочем режиме - может сбоить от частой записи!
 * 4кГц, дец=0,  3 байт/пак, 1   сек 4000 отсч и 12000 байт в пинге, 250 мкс, 60 зап/мин,   3600/час
 * 4кГц, дец=0,  6 байт/пак, 1/2 сек 2000 отсч и 12000 байт в пинге, 250 мкс, 120 зап/мин,  7200/час 
 * 4кГц, дец=0,  9 байт/пак, 1/4 сек 1000 отсч и 18000 байт в пинге, 250 мкс, 240 зап/мин, 14400/час
 * 4кГц, дец=0, 12 байт/пак, 1/4 сек 1000 отсч и 12000 байт в пинге, 250 мкс, 240 зап/мин, 14400/час 
 *************************************************************************************************/
	{ SPS4K, 1,  3, 1,  4000, 12000, 250,  60,  3600}, 
	{ SPS4K, 1,  6, 0,  2000, 12000, 250, 120,  7200}, 
	{ SPS4K, 1,  9, 0,  1000,  9000, 250, 240, 14400}, 
	{ SPS4K, 1, 12, 0,  1000, 12000, 250, 240, 14400}, 
};

#endif /* struct.h  */
